# SQL 3/3

Cours IMT Mines 12-2020

categories: [Cours IMT Mines 12-2020, Bases de données, SGBR-R, SQL, TP]

# Manipuler les données avec SQL

Dans ce dernier TP, nous allons voir comment insérer, mettre à jour ou supprimer des enregistrements dans des tables.

Commencez par valider les cellules suivantes afin d'activer la fonctionnalité SQL de Jupyter et de charger la base du TP précédent.

In [1]:
%load_ext sql

In [2]:
from google.colab import drive
# drive.mount('/content/gdrive')
drive.mount("/content/gdrive", force_remount=True)

Mounted at /content/gdrive

In [3]:
%sql sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db

'Connected: @/content/gdrive/MyDrive/TP_SQL/livres1_db.db'

In [32]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
Done.

[('Langues',),
 ('Auteurs',),
 ('Livres',),
 ('Themes',),
 ('RelationsLivreTheme',)]

## Insérer un enregistrement dans une table

Nous avons déjà rencontré cerre requète **INSERT**. Elle s'applique que la table soit vide ou nom. 

On peut très bien ajouter par exemple une troisième langue dans notre table **Langues**

In [5]:
%sql INSERT INTO Langues (Langue) VALUES('Klingon');

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
1 rows affected.

[]

In [6]:
# Vérifions :
%sql SELECT * FROM Langues;

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
Done.

[(1, 'Anglais'), (2, 'Français'), (3, 'Klingon')]

## Mise a jour, effacement : UPDATE et DELETE

Les requêtes **UPDATE** et **DELETE** fonctionnent sur le même modèle que les requêtes **SELECT**.  Attention, on a vite fait d'effacer toutes ses données si on ne configure pas bien sa requête. Une bonne habitude à prendre est de tester d'abord ses critères à l'aide d'un **SELECT**.

Observez les exemples ci-dessous :

In [33]:
%sql SELECT Nom FROM Auteurs WHERE IdAuteur = 10;

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
Done.

[('Verne',)]

C'est bien lui !!

Modifions le nom de l'auteur grâce à une requête de mise à jour : 

**UPDATE** *table* <br>
**SET**  *attribut1* = *valeur1*, *attribut2* = *valeur2*, ...<br>
**WHERE** *critère*;

In [34]:
%%sql 

UPDATE Auteurs 
SET Nom = "Enrev", Prenom = "Seluj"
WHERE IdAuteur=10;

SELECT * FROM Auteurs ;

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
1 rows affected.
Done.

[(1, 'Orwell', 'George', 1903, 1),
 (2, 'Herbert', 'Frank', 1920, 1),
 (3, 'Asimov', 'Isaac', 1920, 1),
 (4, 'Huxley', 'Aldous', 1894, 1),
 (5, 'Bradbury', 'Ray', 1920, 1),
 (6, 'K. Dick', 'Philip', 1928, 1),
 (7, 'Barjavel', 'René', 1911, 2),
 (8, 'Boulle', 'Pierre', 1912, 2),
 (9, 'Van Vogt', 'Alfred Elton', 1912, 1),
 (10, 'Enrev', 'Seluj', 1850, 2)]

supprimons vite cette entrée ! Nous utiliseerons une requête
**DELETE FROM** *table* **WHERE** *critere*

**Attention** : soyez bien sûr de votre critère sous peine de perdre des données importantes !

In [37]:
%%sql 

DELETE  FROM Auteurs  WHERE IdAuteur=10;

SELECT * FROM Auteurs;

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
1 rows affected.
Done.

[(1, 'Orwell', 'George', 1903, 1),
 (2, 'Herbert', 'Frank', 1920, 1),
 (3, 'Asimov', 'Isaac', 1920, 1),
 (4, 'Huxley', 'Aldous', 1894, 1),
 (5, 'Bradbury', 'Ray', 1920, 1),
 (6, 'K. Dick', 'Philip', 1928, 1),
 (7, 'Barjavel', 'René', 1911, 2),
 (8, 'Boulle', 'Pierre', 1912, 2),
 (9, 'Van Vogt', 'Alfred Elton', 1912, 1)]

### Attention à la cohérence des données

Dans une base de données relationnelle il faut être vigilant lors de la suppression d'enregistrements : en effet la suppression d'un enregistrement entraîne la suppression de sa clé primaire qui peut être utilisée en tant que clé externe dans une autre table. Cela entraîne la corruption des données. Observez l'exemple ci-dessous dans lequel je me suis attribué un livre célèbre sans toucher à la table **Livres**

Il existe en SQL des moyens pour se prémunir de ce type de problèmes mais cela dépasse le cadre de ce cours.

In [38]:
%%sql
INSERT INTO Auteurs 
    (Nom, Prenom, IdLangue, AnneeNaissance) 
VALUES
    ("Alleaume", "Stephane", 2, 1850);
    
SELECT IdAuteur, Titre, Nom from Livres JOIN Auteurs USING (IdAuteur);

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
1 rows affected.
Done.

[(1, '1984', 'Orwell'),
 (2, 'Dune', 'Herbert'),
 (3, 'Fondation', 'Asimov'),
 (4, 'Le meilleur des mondes', 'Huxley'),
 (5, 'Fahrenheit 451', 'Bradbury'),
 (6, 'Ubik', 'K. Dick'),
 (5, 'Chroniques martiennes', 'Bradbury'),
 (7, 'La nuit des temps', 'Barjavel'),
 (6, 'Blade Runner', 'K. Dick'),
 (3, 'Les Robots', 'Asimov'),
 (8, 'La Planète des singes', 'Boulle'),
 (7, 'Ravage', 'Barjavel'),
 (6, 'Le Maître du Haut Château', 'K. Dick'),
 (9, 'Le monde des A', 'Van Vogt'),
 (3, 'La Fin de l’éternité', 'Asimov')]

### A vous de jouer

1. Réinsérez l'auteur Jules Verne à sa place !
1. Supprimez tous les livres écrits au 19e sciecle

In [39]:
%%sql
DELETE  FROM Auteurs  WHERE IdAuteur=10;

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
1 rows affected.

[]

In [40]:
%%sql
INSERT INTO Auteurs 
    (Nom, Prenom, IdLangue, AnneeNaissance) 
VALUES
    ("Verne", "Jules", 2, 1850);

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
1 rows affected.

[]

In [41]:
%%sql
DELETE  FROM Livres  WHERE AnneePubli >= 1800 AND AnneePubli <= 1899;

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
0 rows affected.

[]

In [42]:
result = %sql SELECT Titre, Nom AnneePubli from Livres JOIN Auteurs USING (IdAuteur);

 * sqlite:////content/gdrive/MyDrive/TP_SQL/livres1_db.db
Done.

In [43]:
assert len(result) == 15